In [5]:
import pandas as pd
import numpy as np

In [2]:
dat = pd.Series([1,2,3,4])
dat

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
dat.values

array([1, 2, 3, 4], dtype=int64)

In [6]:
dat2 = pd.Series(np.array([1,3,np.nan,12]))
dat2

0     1.0
1     3.0
2     NaN
3    12.0
dtype: float64

In [13]:
dat2.index = ['호잇','꽃잎','천사','쿠루미상']
dat2

호잇       1.0
꽃잎       3.0
천사       NaN
쿠루미상    12.0
dtype: float64

In [7]:
dat3 = pd.Series(['aa','bb','c','d'])
dat3

0    aa
1    bb
2     c
3     d
dtype: object

In [8]:
dat4 = pd.Series([1,'aa',2.34,'d'])
dat4

0       1
1      aa
2    2.34
3       d
dtype: object

In [9]:
dat5 = pd.Series([1,2,3,4], index = ['호잇','꽃잎','천사','쿠루미상'])
dat5

호잇      1
꽃잎      2
천사      3
쿠루미상    4
dtype: int64

In [10]:
dat6 = pd.Series({'호잇':1,'꽃잎':2,'천사':3,'쿠루미상':4})
dat6

호잇      1
꽃잎      2
천사      3
쿠루미상    4
dtype: int64

In [14]:
dat6.iloc[2]

3

In [17]:
fruit_dat = {'c_지자체': ['예산', '영주','청송','횡성'],
            'a_과일':['복숭아','복숭아','복숭아','복숭아'],
            'b_수확량순위':[1,2,3,4]}
d = pd.DataFrame(fruit_dat)
d

  c_지자체 a_과일  b_수확량순위
0    예산  복숭아        1
1    영주  복숭아        2
2    청송  복숭아        3
3    횡성  복숭아        4

In [18]:
d.columns

Index(['c_지자체', 'a_과일', 'b_수확량순위'], dtype='object')

In [29]:
s1 = d.c_지자체
s1

0    예산
1    영주
2    청송
3    횡성
Name: c_지자체, dtype: object

In [32]:
s1 = d['c_지자체']
s1

0    예산
1    영주
2    청송
3    횡성
Name: c_지자체, dtype: object

In [33]:
data = pd.Series(np.random.randn(10), index =[['a','a','a','b','b','b','c','c','d','d'],
                                             [1,2,3,1,2,3,1,2,2,3]])
data

a  1    0.005895
   2    0.128996
   3    0.636443
b  1   -0.638943
   2    0.372304
   3    0.760752
c  1   -0.709668
   2    0.307548
d  2   -0.653932
   3   -1.483274
dtype: float64

In [34]:
data.iloc[2]

0.6364428469738093

In [38]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                     index = [['a','a','b','b'],[1,2,1,2]],
                    columns=[['Ohio','Ohio','Colorado'],
                            ['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [39]:
s1 = pd.Series([1,2,3,4])
s2 = pd.Series([10,20,30,40,50])
s1 + s2

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [41]:
data = [[256.5,770.6,363.5,139.3],
        [264.3,567.5,231.2,59.9],
        [215.9,599.8,293.1,76.9],
        [223.2,387.1,247.7,109.1],
        [312.8,446.2,381.6,108.1]]

frame = pd.DataFrame(data,
                    index = [2012, 2013, 2014, 2015, 2016],
                    columns = ['봄','여름','가을','겨울'])

frame

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [42]:
frame.mean()

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [43]:
frame.mean(axis=1)

2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [45]:
frame.std()

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

In [47]:
frame.describe() # 여기서 min,25%,50%,75% 자료를 4분위수 (quartile) 이라고 한다.

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000